## Plan Result (shared-snowplow-consumer-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/246677)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 2 to destroy.</code></pre>

* Delete
  * aws_cloudwatch_log_group.shared-snowplow-consumer-app_aws-otel-collector-log-group_408C8F4B
* Replace
  * aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.shared-snowplow-consumer-app_aws-otel-collector-log-group_408C8F4B will be destroyed
  # (because aws_cloudwatch_log_group.shared-snowplow-consumer-app_aws-otel-collector-log-group_408C8F4B is not in configuration)
  - resource "aws_cloudwatch_log_group" "shared-snowplow-consumer-app_aws-otel-collector-log-group_408C8F4B" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/Backend/SharedSnowplowConsumer-Prod/ecs/aws-otel-collector" -> null
      - id                = "/Backend/SharedSnowplowConsumer-Prod/ecs/aws-otel-collector" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/Backend/SharedSnowplowConsumer-Prod/ecs/aws-otel-collector" -> null
      - retention_in_days = 90 -> null
      - skip_destroy      = true -> null
      - tags              = {
          - "app_code"       = "pocket-content-shared"
          - "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
          - "costCenter"     = "Shared"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "SharedSnowplowConsumer"
        } -> null
      - tags_all          = {
          - "app_code"       = "pocket-content-shared"
          - "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
          - "costCenter"     = "Shared"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "SharedSnowplowConsumer"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B must be replaced
-/+ resource "aws_ecs_task_definition" "shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharedSnowplowConsumer-Prod:216" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharedSnowplowConsumer-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        {
                            name  = "NODE_ENV"
                            value = "production"
                        },
                      - {
                          - name  = "OTLP_COLLECTOR_HOST"
                          - value = "localhost"
                        },
                        {
                            name  = "SNOWPLOW_ENDPOINT"
                            value = "com-getpocket-prod1.collector.snplow.net"
                        },
                        # (2 unchanged elements hidden)
                    ]
                    name                   = "app"
                    # (11 unchanged attributes hidden)
                },
              - {
                  - command                = [
                      - "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  - image                  = "amazon/aws-otel-collector"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group             = "/Backend/SharedSnowplowConsumer-Prod/ecs/aws-otel-collector"
                          - awslogs-multiline-pattern = "^\\S.+"
                          - awslogs-region            = "us-east-1"
                          - awslogs-stream-prefix     = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "aws-otel-collector"
                  - portMappings           = [
                      - {
                          - containerPort = 4138
                          - hostPort      = 4138
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4137
                          - hostPort      = 4137
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - repositoryCredentials  = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "SharedSnowplowConsumer-Prod" -> (known after apply)
      ~ revision                 = 216 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket-content-shared"
            "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
            "costCenter"     = "Shared"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "SharedSnowplowConsumer"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharedSnowplowConsumer-Prod:216" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"805daebd-0040-4771-9a85-da1b05c9b889","JobName":"shared-snowplow-consumer_infrastructure_plan_prod","PRNumber":675,"Program":"tfcmt","SHA1":"43abfa663c90642dd0745cde44ee02d4f29fd3f4","Target":"shared-snowplow-consumer-cdk","Vars":{}} -->